miq312/Ledy_Stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define button1_Pin GPIO_PIN_5
#define button1_GPIO_Port GPIOC
#define ld6_Pin GPIO_PIN_10
#define ld6_GPIO_Port GPIOB
#define ld7_Pin GPIO_PIN_11
#define ld7_GPIO_Port GPIOB
#define ld8_Pin GPIO_PIN_12
#define ld8_GPIO_Port GPIOB
#define ld9_Pin GPIO_PIN_13
#define ld9_GPIO_Port GPIOB
#define ld10_Pin GPIO_PIN_14
#define ld10_GPIO_Port GPIOB
#define button2_Pin GPIO_PIN_6
#define button2_GPIO_Port GPIOC
#define button3_Pin GPIO_PIN_8
#define button3_GPIO_Port GPIOC
#define ld1_Pin GPIO_PIN_5
#define ld1_GPIO_Port GPIOB
#define ld2_Pin GPIO_PIN_6
#define ld2_GPIO_Port GPIOB
#define ld3_Pin GPIO_PIN_7
#define ld3_GPIO_Port GPIOB
#define ld4_Pin GPIO_PIN_8
#define ld4_GPIO_Port GPIOB
#define ld5_Pin GPIO_PIN_9
#define ld5_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
